In [1]:
import pandas as pd
import numpy as np

#conocer la version de pandas
pd.__version__

'1.3.4'

In [2]:
dict_data = {"CH":[100,800,200],"CO":[100,200,300],"MX":[300,500,400]}
dict_data

{'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}

In [4]:
df = pd.DataFrame(dict_data)
df

    CH   CO   MX
0  100  100  300
1  800  200  500
2  200  300  400

In [7]:

dict_data_dos = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
dict_data_dos

{'edad': [10, 9, 13, 14, 12, 11, 12],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9]}

In [9]:
df_dos = pd.DataFrame(dict_data_dos)
df_dos

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

In [21]:
#en un dataframe se pueden definir los indices
df_dos = pd.DataFrame(dict_data_dos,index=("Ana","Benito","Camilo","Daniel","Ericka","Fabian","Gabriela"))
df_dos

          edad   cm pais genero    Q1  Q2
Ana         10  115   co      M   5.0   7
Benito       9  110   mx      F  10.0   9
Camilo      13  130   co      F   8.0   9
Daniel      14  155   mx      M   NaN   8
Ericka      12  125   mx      M   7.0   8
Fabian      11  120   ch      M   8.0   8
Gabriela    12  125   ch      F   3.0   9

In [12]:
#ver los indes de nuestro dataframe
df_dos.index

Index(['UNO', 'DOS', 'TRES', 'CUATRO', 'CINCO', 'SEIS', 'SIETE'], dtype='object')

In [13]:
#para ver las columnas de nuestro dataframe
df_dos.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [14]:
#para ver las columnas de nuestro dataframe
df_dos.values

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

In [17]:
#obtener un subconjunto de datos (columna edad)

df_dos['edad']

UNO       10
DOS        9
TRES      13
CUATRO    14
CINCO     12
SEIS      11
SIETE     12
Name: edad, dtype: int64

In [20]:
df_dos[['edad', 'cm', 'pais']]

        edad   cm pais
UNO       10  115   co
DOS        9  110   mx
TRES      13  130   co
CUATRO    14  155   mx
CINCO     12  125   mx
SEIS      11  120   ch
SIETE     12  125   ch

In [24]:
df_dos.loc["Ana",['edad', 'cm', 'pais']]

edad     10
cm      115
pais     co
Name: Ana, dtype: object

In [25]:
df_dos.loc[["Ana","Gabriela"],['genero','edad', 'cm', 'pais']]

         genero  edad   cm pais
Ana           M    10  115   co
Gabriela      F    12  125   ch

In [26]:
df_dos.iloc[2,1]

130

In [27]:
df_dos.iloc[2,[1,2,3]]

cm        130
pais       co
genero      F
Name: Camilo, dtype: object

In [28]:
df_dos.iloc[[2,3,4],[2,3,4]]

       pais genero   Q1
Camilo   co      F  8.0
Daniel   mx      M  NaN
Ericka   mx      M  7.0

In [29]:
df_dos.iloc[:,[1,3]]

           cm genero
Ana       115      M
Benito    110      F
Camilo    130      F
Daniel    155      M
Ericka    125      M
Fabian    120      M
Gabriela  125      F

In [31]:
#comparar valores por medio de comparadores
df_dos["edad"] >= 12

Ana         False
Benito      False
Camilo       True
Daniel       True
Ericka       True
Fabian      False
Gabriela     True
Name: edad, dtype: bool

In [33]:
df_dos[df_dos["edad"] >= 12]

          edad   cm pais genero   Q1  Q2
Camilo      13  130   co      F  8.0   9
Daniel      14  155   mx      M  NaN   8
Ericka      12  125   mx      M  7.0   8
Gabriela    12  125   ch      F  3.0   9

In [35]:
df_dos[(df_dos["edad"] >= 12) & (df_dos["pais"] == "mx") ]

        edad   cm pais genero   Q1  Q2
Daniel    14  155   mx      M  NaN   8
Ericka    12  125   mx      M  7.0   8

In [36]:
df_dos.query("edad > 12")

        edad   cm pais genero   Q1  Q2
Camilo    13  130   co      F  8.0   9
Daniel    14  155   mx      M  NaN   8